spec/cassettes/Payment/updating_Close_io_when_a_payment_is_made/updates_status_and_amount_paid_on_the_first_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: description=test%40test.com
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
      Content-Length:
      - '27'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Feb 2016 19:28:26 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1151'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7sS4psgru20V4c
      Stripe-Version:
      - '2012-11-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_7sS4T7A3VhI9gh",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "count": 0,
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/bank_accounts"
          },
          "cards": {
            "object": "list",
            "count": 0,
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/cards"
          },
          "created": 1455046105,
          "currency": null,
          "default_bank_account": null,
          "default_card": null,
          "default_source": null,
          "default_source_type": null,
          "delinquent": false,
          "description": "test@test.com",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "count": 0,
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/sources"
          },
          "subscriptions": {
            "object": "list",
            "count": 0,
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/subscriptions"
          },
          "active_card": null,
          "subscription": null
        }
    http_version: 
  recorded_at: Tue, 09 Feb 2016 19:28:45 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_7sS4T7A3VhI9gh/sources
    body:
      encoding: UTF-8
      string: source[account_number]=000123456789&source[country]=US&source[object]=bank_account&source[routing_number]=110000000
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
      Content-Length:
      - '115'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Feb 2016 19:28:26 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '408'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7sS4XN5uODVtBt
      Stripe-Version:
      - '2012-11-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ba_7sS4GsLeI2SXRn",
          "object": "bank_account",
          "account_holder_type": null,
          "bank_name": "STRIPE TEST BANK",
          "country": "US",
          "currency": "usd",
          "customer": "cus_7sS4T7A3VhI9gh",
          "fingerprint": "qw2YdYDmIJUuNi9w",
          "last4": "6789",
          "metadata": {},
          "name": null,
          "routing_number": "110000000",
          "status": "new",
          "disabled": false,
          "validated": false,
          "verified": false
        }
    http_version: 
  recorded_at: Tue, 09 Feb 2016 19:28:46 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_7sS4T7A3VhI9gh
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Feb 2016 19:28:26 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2233'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7sS4PZ15dOgEVD
      Stripe-Version:
      - '2012-11-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_7sS4T7A3VhI9gh",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "count": 1,
            "data": [
              {
                "id": "ba_7sS4GsLeI2SXRn",
                "object": "bank_account",
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_7sS4T7A3VhI9gh",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "name": null,
                "routing_number": "110000000",
                "status": "new",
                "disabled": false,
                "validated": false,
                "verified": false
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/bank_accounts"
          },
          "cards": {
            "object": "list",
            "count": 0,
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/cards"
          },
          "created": 1455046105,
          "currency": null,
          "default_bank_account": "ba_7sS4GsLeI2SXRn",
          "default_card": null,
          "default_source": "ba_7sS4GsLeI2SXRn",
          "default_source_type": "bank_account",
          "delinquent": false,
          "description": "test@test.com",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "count": 1,
            "data": [
              {
                "id": "ba_7sS4GsLeI2SXRn",
                "object": "bank_account",
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_7sS4T7A3VhI9gh",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "name": null,
                "routing_number": "110000000",
                "status": "new",
                "disabled": false,
                "validated": false,
                "verified": false
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/sources"
          },
          "subscriptions": {
            "object": "list",
            "count": 0,
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/subscriptions"
          },
          "active_card": null,
          "subscription": null
        }
    http_version: 
  recorded_at: Tue, 09 Feb 2016 19:28:46 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_7sS4T7A3VhI9gh/sources/ba_7sS4GsLeI2SXRn
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Feb 2016 19:28:26 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '408'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7sS4L0reKIxYn2
      Stripe-Version:
      - '2012-11-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ba_7sS4GsLeI2SXRn",
          "object": "bank_account",
          "account_holder_type": null,
          "bank_name": "STRIPE TEST BANK",
          "country": "US",
          "currency": "usd",
          "customer": "cus_7sS4T7A3VhI9gh",
          "fingerprint": "qw2YdYDmIJUuNi9w",
          "last4": "6789",
          "metadata": {},
          "name": null,
          "routing_number": "110000000",
          "status": "new",
          "disabled": false,
          "validated": false,
          "verified": false
        }
    http_version: 
  recorded_at: Tue, 09 Feb 2016 19:28:46 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_7sS4T7A3VhI9gh
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Feb 2016 19:28:26 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2233'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7sS4uTv5W8ZboC
      Stripe-Version:
      - '2012-11-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_7sS4T7A3VhI9gh",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "count": 1,
            "data": [
              {
                "id": "ba_7sS4GsLeI2SXRn",
                "object": "bank_account",
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_7sS4T7A3VhI9gh",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "name": null,
                "routing_number": "110000000",
                "status": "new",
                "disabled": false,
                "validated": false,
                "verified": false
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/bank_accounts"
          },
          "cards": {
            "object": "list",
            "count": 0,
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/cards"
          },
          "created": 1455046105,
          "currency": null,
          "default_bank_account": "ba_7sS4GsLeI2SXRn",
          "default_card": null,
          "default_source": "ba_7sS4GsLeI2SXRn",
          "default_source_type": "bank_account",
          "delinquent": false,
          "description": "test@test.com",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "count": 1,
            "data": [
              {
                "id": "ba_7sS4GsLeI2SXRn",
                "object": "bank_account",
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_7sS4T7A3VhI9gh",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "name": null,
                "routing_number": "110000000",
                "status": "new",
                "disabled": false,
                "validated": false,
                "verified": false
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/sources"
          },
          "subscriptions": {
            "object": "list",
            "count": 0,
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/subscriptions"
          },
          "active_card": null,
          "subscription": null
        }
    http_version: 
  recorded_at: Tue, 09 Feb 2016 19:28:46 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_7sS4T7A3VhI9gh/sources/ba_7sS4GsLeI2SXRn/verify
    body:
      encoding: UTF-8
      string: amounts[]=32&amounts[]=45
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
      Content-Length:
      - '25'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Feb 2016 19:28:27 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '412'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7sS4oF1HFobIgm
      Stripe-Version:
      - '2012-11-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ba_7sS4GsLeI2SXRn",
          "object": "bank_account",
          "account_holder_type": null,
          "bank_name": "STRIPE TEST BANK",
          "country": "US",
          "currency": "usd",
          "customer": "cus_7sS4T7A3VhI9gh",
          "fingerprint": "qw2YdYDmIJUuNi9w",
          "last4": "6789",
          "metadata": {},
          "name": null,
          "routing_number": "110000000",
          "status": "verified",
          "disabled": false,
          "validated": false,
          "verified": true
        }
    http_version: 
  recorded_at: Tue, 09 Feb 2016 19:28:47 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_7sS4T7A3VhI9gh
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Feb 2016 19:28:27 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2241'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7sS4vMaLJBnr4X
      Stripe-Version:
      - '2012-11-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_7sS4T7A3VhI9gh",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "count": 1,
            "data": [
              {
                "id": "ba_7sS4GsLeI2SXRn",
                "object": "bank_account",
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_7sS4T7A3VhI9gh",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "name": null,
                "routing_number": "110000000",
                "status": "verified",
                "disabled": false,
                "validated": false,
                "verified": true
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/bank_accounts"
          },
          "cards": {
            "object": "list",
            "count": 0,
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/cards"
          },
          "created": 1455046105,
          "currency": null,
          "default_bank_account": "ba_7sS4GsLeI2SXRn",
          "default_card": null,
          "default_source": "ba_7sS4GsLeI2SXRn",
          "default_source_type": "bank_account",
          "delinquent": false,
          "description": "test@test.com",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "count": 1,
            "data": [
              {
                "id": "ba_7sS4GsLeI2SXRn",
                "object": "bank_account",
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_7sS4T7A3VhI9gh",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "name": null,
                "routing_number": "110000000",
                "status": "verified",
                "disabled": false,
                "validated": false,
                "verified": true
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/sources"
          },
          "subscriptions": {
            "object": "list",
            "count": 0,
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7sS4T7A3VhI9gh/subscriptions"
          },
          "active_card": null,
          "subscription": null
        }
    http_version: 
  recorded_at: Tue, 09 Feb 2016 19:28:47 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=27000&currency=usd&customer=cus_7sS4T7A3VhI9gh&source=ba_7sS4GsLeI2SXRn
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
      Content-Length:
      - '78'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 09 Feb 2016 19:28:28 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1176'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7sS4dzMD3g9EqS
      Stripe-Version:
      - '2012-11-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "py_7sS4nowhEq9uf5",
          "object": "charge",
          "amount": 27000,
          "amount_refunded": 0,
          "application_fee": null,
          "balance_transaction": "txn_7sS4kBjoXMvtbn",
          "captured": true,
          "card": null,
          "created": 1455046108,
          "currency": "usd",
          "customer": "cus_7sS4T7A3VhI9gh",
          "description": null,
          "destination": null,
          "dispute": null,
          "failure_code": null,
          "failure_message": null,
          "fraud_details": {},
          "invoice": null,
          "livemode": false,
          "metadata": {},
          "order": null,
          "paid": false,
          "receipt_email": null,
          "receipt_number": null,
          "refunded": false,
          "refunds": [],
          "shipping": null,
          "source": {
            "id": "ba_7sS4GsLeI2SXRn",
            "object": "bank_account",
            "account_holder_type": null,
            "bank_name": "STRIPE TEST BANK",
            "country": "US",
            "currency": "usd",
            "customer": "cus_7sS4T7A3VhI9gh",
            "fingerprint": "qw2YdYDmIJUuNi9w",
            "last4": "6789",
            "metadata": {},
            "name": null,
            "routing_number": "110000000",
            "status": "verified",
            "disabled": false,
            "validated": false,
            "verified": true
          },
          "statement_descriptor": null,
          "status": "pending",
          "statement_description": null
        }
    http_version: 
  recorded_at: Tue, 09 Feb 2016 19:28:48 GMT
recorded_with: VCR 3.0.1
